# ETL

# Libraries

In [22]:
import os
import ast

import pandas as pd

# Extract

Los dos datasets se descargan de esta direcci√≥n:

https://drive.google.com/drive/folders/1X_LdCoGTHJDbD28_dJTxaD4fVuQC9Wt5

Los datasets deben estar en una carpeta llamada `raw` ubicada en la raiz del proyecto.

In [3]:
ruta_raw = os.path.abspath('../raw/')

## Extract `movies`

In [4]:
movies_df = pd.read_csv(
    os.path.join(
        ruta_raw, 'movies_dataset.csv'))

C:\Users\franc\AppData\Local\Temp\ipykernel_7720\1449174679.py:1: DtypeWarning: Columns (10) have mixed types. Specify dtype option on import or set low_memory=False.
  movies_df = pd.read_csv(

In [5]:
movies_df.head().T

,0,1,2,3,4
adult,False,False,False,False,False
belongs_to_collection,"{'id': 10194, 'name': 'Toy Story Collection', ...",NaN,"{'id': 119050, 'name': 'Grumpy Old Men Collect...",NaN,"{'id': 96871, 'name': 'Father of the Bride Col..."
budget,30000000,65000000,0,16000000,0
genres,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...","[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...","[{'id': 10749, 'name': 'Romance'}, {'id': 35, ...","[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...","[{'id': 35, 'name': 'Comedy'}]"
homepage,http://toystory.disney.com/toy-story,NaN,NaN,NaN,NaN
id,862,8844,15602,31357,11862
imdb_id,tt0114709,tt0113497,tt0113228,tt0114885,tt0113041
original_language,en,en,en,en,en
original_title,Toy Story,Jumanji,Grumpier Old Men,Waiting to Exhale,Father of the Bride Part II
overview,"Led by Woody, Andy's toys live happily in his ...",When siblings Judy and Peter discover an encha...,A family wedding reignites the ancient feud be...,"Cheated on, mistreated and stepped on, the wom...",Just when George Banks has recovered from his ...
popularity,21.946943,17.015539,11.7129,3.859495,8.387519
poster_path,/rhIRbceoE9lR4veEXuwCC2wARtG.jpg,/vzmL6fP7aPKNKPRTFnZmiUfciyV.jpg,/6ksm1sjKMFLbO7UY2i6G1ju9SML.jpg,/16XOMpEaLWkrcPqSQqhTmeJuqQl.jpg,/e64sOI48hQXyru7naBFyssKFxVd.jpg
production_companies,"[{'name': 'Pixar Animation Studios', 'id': 3}]","[{'name': 'TriStar Pictures', 'id': 559}, {'na...","[{'name': 'Warner Bros.', 'id': 6194}, {'name'...",[{'name': 'Twentieth Century Fox Film Corporat...,"[{'name': 'Sandollar Productions', 'id': 5842}..."
production_countries,"[{'iso_3166_1': 'US', 'name': 'United States o...","[{'iso_3166_1': 'US', 'name': 'United States o...","[{'iso_3166_1': 'US', 'name': 'United States o...","[{'iso_3166_1': 'US', 'name': 'United States o...","[{'iso_3166_1': 'US', 'name': 'United States o..."
release_date,1995-10-30,1995-12-15,1995-12-22,1995-12-22,1995-02-10
revenue,373554033.0,262797249.0,0.0,81452156.0,76578911.0
runtime,81.0,104.0,101.0,127.0,106.0
spoken_languages,"[{'iso_639_1': 'en', 'name': 'English'}]","[{'iso_639_1': 'en', 'name': 'English'}, {'iso...","[{'iso_639_1': 'en', 'name': 'English'}]","[{'iso_639_1': 'en', 'name': 'English'}]","[{'iso_639_1': 'en', 'name': 'English'}]"
status,Released,Released,Released,Released,Released
tagline,NaN,Roll the dice and unleash the excitement!,Still Yelling. Still Fighting. Still Ready for...,Friends are the people who let you be yourself...,Just When His World Is Back To Normal... He's ...
title,Toy Story,Jumanji,Grumpier Old Men,Waiting to Exhale,Father of the Bride Part II
video,False,False,False,False,False
vote_average,7.7,6.9,6.5,6.1,5.7
vote_count,5415.0,2413.0,92.0,34.0,173.0

## Extract `credits`

In [6]:
credits_df = pd.read_csv(
    os.path.join(
        ruta_raw, 'credits.csv'))

In [7]:
credits_df.head()

,cast,crew,id
0,"[{'cast_id': 14, 'character': 'Woody (voice)',...","[{'credit_id': '52fe4284c3a36847f8024f49', 'de...",862
1,"[{'cast_id': 1, 'character': 'Alan Parrish', '...","[{'credit_id': '52fe44bfc3a36847f80a7cd1', 'de...",8844
2,"[{'cast_id': 2, 'character': 'Max Goldman', 'c...","[{'credit_id': '52fe466a9251416c75077a89', 'de...",15602
3,"[{'cast_id': 1, 'character': ""Savannah 'Vannah...","[{'credit_id': '52fe44779251416c91011acb', 'de...",31357
4,"[{'cast_id': 1, 'character': 'George Banks', '...","[{'credit_id': '52fe44959251416c75039ed7', 'de...",11862

# Transform

Transformaciones a realizar:

- Algunos campos, como belongs_to_collection, production_companies y otros (ver diccionario de datos) est√°n anidados, esto es o bien tienen un diccionario o una lista como valores en cada fila, ¬°deber√°n desanidarlos para poder y unirlos al dataset de nuevo hacer alguna de las consultas de la API! O bien buscar la manera de acceder a esos datos sin desanidarlos.

- Los valores nulos de los campos revenue, budget deben ser rellenados por el n√∫mero 0.

- Los valores nulos del campo release date deben eliminarse.

- De haber fechas, deber√°n tener el formato AAAA-mm-dd, adem√°s deber√°n crear la columna release_year donde extraer√°n el a√±o de la fecha de estreno.

- Crear la columna con el retorno de inversi√≥n, llamada return con los campos revenue y budget, dividiendo estas dos √∫ltimas revenue / budget, cuando no hay datos disponibles para calcularlo, deber√° tomar el valor 0.

- Eliminar las columnas que no ser√°n utilizadas, video,imdb_id,adult,original_title,poster_path y homepage.

## Transform movies

In [10]:
movies_df.head(1).T

                                                                       0
adult                                                              False
belongs_to_collection  {'id': 10194, 'name': 'Toy Story Collection', ...
budget                                                          30000000
genres                 [{'id': 16, 'name': 'Animation'}, {'id': 35, '...
homepage                            http://toystory.disney.com/toy-story
id                                                                   862
imdb_id                                                        tt0114709
original_language                                                     en
original_title                                                 Toy Story
overview               Led by Woody, Andy's toys live happily in his ...
popularity                                                     21.946943
poster_path                             /rhIRbceoE9lR4veEXuwCC2wARtG.jpg
production_companies      [{'name': 'Pixar Animation Studios', 'id': 3}]
production_countries   [{'iso_3166_1': 'US', 'name': 'United States o...
release_date                                                  1995-10-30
revenue                                                      373554033.0
runtime                                                             81.0
spoken_languages                [{'iso_639_1': 'en', 'name': 'English'}]
status                                                          Released
tagline                                                              NaN
title                                                          Toy Story
video                                                              False
vote_average                                                         7.7
vote_count                                                        5415.0

### Unnesting

#### belongs_to_collection

In [18]:
belongs_to_collection = movies_df[['id', 'belongs_to_collection']].copy()

In [24]:
belongs_to_collection.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45466 entries, 0 to 45465
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   movie_id         45466 non-null  object
 1   collection_name  4494 non-null   object
dtypes: object(2)
memory usage: 710.5+ KB

In [19]:
belongs_to_collection.head(5)

      id                              belongs_to_collection
0    862  {'id': 10194, 'name': 'Toy Story Collection', ...
1   8844                                                NaN
2  15602  {'id': 119050, 'name': 'Grumpy Old Men Collect...
3  31357                                                NaN
4  11862  {'id': 96871, 'name': 'Father of the Bride Col...

In [20]:
belongs_to_collection.rename(
    columns={
        'id': 'movie_id',
        'belongs_to_collection': 'collection_name'
    },
    inplace=True)

In [21]:
belongs_to_collection.head(5)

  movie_id                                    collection_name
0      862  {'id': 10194, 'name': 'Toy Story Collection', ...
1     8844                                                NaN
2    15602  {'id': 119050, 'name': 'Grumpy Old Men Collect...
3    31357                                                NaN
4    11862  {'id': 96871, 'name': 'Father of the Bride Col...

In [25]:
belongs_to_collection['collection_name'] = belongs_to_collection['collection_name'].apply(lambda x: ast.literal_eval(x) if pd.notna(x) else x)

new_columns = pd.json_normalize(belongs_to_collection['collection_name'])

belongs_to_collection = belongs_to_collection.join(new_columns)

belongs_to_collection.drop(columns=['collection_name'], inplace=True)

belongs_to_collection.rename(
    columns={
        'id': 'collection_id',
        'name': 'collection_name'
    },
    inplace=True)

In [26]:
belongs_to_collection.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45466 entries, 0 to 45465
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   movie_id         45466 non-null  object
 1   collection_id    4491 non-null   float64
 2   collection_name  4491 non-null   object
 3   poster_path      3948 non-null   object
 4   backdrop_path    3263 non-null   object
dtypes: float64(1), object(4)
memory usage: 1.7+ MB

In [27]:
belongs_to_collection.head()

,movie_id,collection_id,collection_name,poster_path,backdrop_path
0,862,10194.0,Toy Story Collection,/7G9915LfUQ2lVfwMEEhDsn3kT4B.jpg,/9FBwqcd9IRruEDUrTdcaafOMKUq.jpg
1,8844,NaN,NaN,NaN,NaN
2,15602,119050.0,Grumpy Old Men Collection,/nLvUdqgPgm3F85NMCii9gVFUcet.jpg,/hypTnLot2z8wpFS7qwsQHW1uV8u.jpg
3,31357,NaN,NaN,NaN,NaN
4,11862,96871.0,Father of the Bride Collection,/nts4iOmNnq7GNicycMJ9pSAn204.jpg,/7qwE57OVZmMJChBpLEbJEmzUydk.jpg

In [30]:
belongs_to_collection['collection_id'].value_counts()

collection_id
415931.0    29
421566.0    27
645.0       26
96887.0     26
37261.0     25
            ..
463112.0     1
474012.0     1
284700.0     1
142686.0     1
267551.0     1
Name: count, Length: 1695, dtype: int64

#### genres

In [59]:
genres = movies_df[['id', 'genres']].copy()

In [60]:
genres.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45466 entries, 0 to 45465
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      45466 non-null  object
 1   genres  45466 non-null  object
dtypes: object(2)
memory usage: 710.5+ KB

In [61]:
genres.head(5)

      id                                             genres
0    862  [{'id': 16, 'name': 'Animation'}, {'id': 35, '...
1   8844  [{'id': 12, 'name': 'Adventure'}, {'id': 14, '...
2  15602  [{'id': 10749, 'name': 'Romance'}, {'id': 35, ...
3  31357  [{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...
4  11862                     [{'id': 35, 'name': 'Comedy'}]

In [62]:
genres.rename(
    columns={
        'id': 'movie_id'
    },
    inplace=True)

In [63]:
genres.head(5)

  movie_id                                             genres
0      862  [{'id': 16, 'name': 'Animation'}, {'id': 35, '...
1     8844  [{'id': 12, 'name': 'Adventure'}, {'id': 14, '...
2    15602  [{'id': 10749, 'name': 'Romance'}, {'id': 35, ...
3    31357  [{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...
4    11862                     [{'id': 35, 'name': 'Comedy'}]

In [64]:
genres['genres'] = genres['genres'].apply(lambda x: ast.literal_eval(str(x)) if isinstance(x, str) and pd.notna(x) else x)

exploded = genres.explode('genres')

new_columns = pd.json_normalize(exploded['genres'])

genres = exploded.drop(columns=['genres']).reset_index(drop=True).join(new_columns)

In [65]:
genres.head(5)

  movie_id       id       name
0      862     16.0  Animation
1      862     35.0     Comedy
2      862  10751.0     Family
3     8844     12.0  Adventure
4     8844     14.0    Fantasy

In [66]:
genres.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 93548 entries, 0 to 93547
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   movie_id  93548 non-null  object
 1   id        91106 non-null  float64
 2   name      91106 non-null  object
dtypes: float64(1), object(2)
memory usage: 2.1+ MB

In [67]:
genres.rename(
    columns={
        'id': 'genre_id',
        'name': 'genre_name'
    },
    inplace=True)

In [69]:
genres.columns

Index(['movie_id', 'genre_id', 'genre_name'], dtype='object')

In [72]:
genres['genre_id'].value_counts()

genre_id
18.0       20265
35.0       13182
53.0        7624
10749.0     6735
28.0        6596
27.0        4673
80.0        4307
99.0        3932
12.0        3496
878.0       3049
10751.0     2770
9648.0      2467
14.0        2313
16.0        1935
10769.0     1622
10402.0     1598
36.0        1398
10752.0     1323
37.0        1042
10770.0      767
11176.0        1
11602.0        1
29812.0        1
2883.0         1
7759.0         1
7760.0         1
7761.0         1
33751.0        1
17161.0        1
18012.0        1
18013.0        1
23822.0        1
Name: count, dtype: int64

#### production_companies

In [73]:
production_companies = movies_df[['id', 'production_companies']].copy()

In [74]:
production_companies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45466 entries, 0 to 45465
Data columns (total 2 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   id                    45466 non-null  object
 1   production_companies  45463 non-null  object
dtypes: object(2)
memory usage: 710.5+ KB

In [75]:
production_companies.head(5)

      id                               production_companies
0    862     [{'name': 'Pixar Animation Studios', 'id': 3}]
1   8844  [{'name': 'TriStar Pictures', 'id': 559}, {'na...
2  15602  [{'name': 'Warner Bros.', 'id': 6194}, {'name'...
3  31357  [{'name': 'Twentieth Century Fox Film Corporat...
4  11862  [{'name': 'Sandollar Productions', 'id': 5842}...

In [76]:
production_companies.rename(
    columns={
        'id': 'movie_id'
    },
    inplace=True)

In [77]:
production_companies.columns

Index(['movie_id', 'production_companies'], dtype='object')

In [78]:
production_companies['production_companies'] = production_companies['production_companies'].apply(lambda x: ast.literal_eval(str(x)) if isinstance(x, str) and pd.notna(x) else x)

exploded = production_companies.explode('production_companies')

new_columns = pd.json_normalize(exploded['production_companies'])

production_companies = exploded.drop(columns=['production_companies']).reset_index(drop=True).join(new_columns)

In [79]:
production_companies.head(5)

  movie_id                       name       id
0      862    Pixar Animation Studios      3.0
1     8844           TriStar Pictures    559.0
2     8844               Teitler Film   2550.0
3     8844  Interscope Communications  10201.0
4    15602               Warner Bros.   6194.0

In [80]:
production_companies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 82426 entries, 0 to 82425
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   movie_id  82426 non-null  object
 1   name      70545 non-null  object
 2   id        70545 non-null  float64
dtypes: float64(1), object(2)
memory usage: 1.9+ MB

In [81]:
production_companies.rename(
    columns={
        'id': 'company_id', 
        'name': 'company_name'
    },
    inplace=True)

In [82]:
production_companies.columns

Index(['movie_id', 'company_name', 'company_id'], dtype='object')

In [83]:
production_companies['company_name'].value_counts()

company_name
Warner Bros.                              1250
Metro-Goldwyn-Mayer (MGM)                 1076
Paramount Pictures                        1003
Twentieth Century Fox Film Corporation     836
Universal Pictures                         830
                                          ...
Inside Track 1                               1
Film Council Premiere Fund                   1
Untitled 03                                  1
absolutely productions                       1
Yermoliev                                    1
Name: count, Length: 23537, dtype: int64

#### production_countries

In [84]:
production_countries = movies_df[['id', 'production_countries']].copy()

In [85]:
production_countries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45466 entries, 0 to 45465
Data columns (total 2 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   id                    45466 non-null  object
 1   production_countries  45463 non-null  object
dtypes: object(2)
memory usage: 710.5+ KB

In [86]:
production_countries.head(5)

      id                               production_countries
0    862  [{'iso_3166_1': 'US', 'name': 'United States o...
1   8844  [{'iso_3166_1': 'US', 'name': 'United States o...
2  15602  [{'iso_3166_1': 'US', 'name': 'United States o...
3  31357  [{'iso_3166_1': 'US', 'name': 'United States o...
4  11862  [{'iso_3166_1': 'US', 'name': 'United States o...

In [87]:
production_countries.rename(
    columns={
        'id': 'movie_id'
    },
    inplace=True)

In [88]:
production_countries.columns

Index(['movie_id', 'production_countries'], dtype='object')

In [89]:
production_countries['production_countries'] = production_countries['production_countries'].apply(lambda x: ast.literal_eval(str(x)) if isinstance(x, str) and pd.notna(x) else x)

exploded = production_countries.explode('production_countries')

new_columns = pd.json_normalize(exploded['production_countries'])

production_countries = exploded.drop(columns=['production_countries']).reset_index(drop=True).join(new_columns)

In [90]:
production_countries.head(5)

  movie_id iso_3166_1                      name
0      862         US  United States of America
1     8844         US  United States of America
2    15602         US  United States of America
3    31357         US  United States of America
4    11862         US  United States of America

In [91]:
production_countries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 55711 entries, 0 to 55710
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   movie_id    55711 non-null  object
 1   iso_3166_1  49423 non-null  object
 2   name        49423 non-null  object
dtypes: object(3)
memory usage: 1.3+ MB

In [92]:
production_countries.rename(
    columns={
        'name': 'country_name'
    },
    inplace=True)

In [93]:
production_countries.columns

Index(['movie_id', 'iso_3166_1', 'country_name'], dtype='object')

In [94]:
production_countries['country_name'].value_counts()

country_name
United States of America    21153
United Kingdom               4094
France                       3940
Germany                      2254
Italy                        2169
                            ...
Antarctica                      1
Gibraltar                       1
Brunei Darussalam               1
Honduras                        1
Guinea                          1
Name: count, Length: 160, dtype: int64